const settingsDefault = {  
  'steps': {
    '2' : [
      {
        'key': 21,
        'value': 80,
        'text': 'Классов "автомагистраль", "скоростная автомобильная дорога", категорий I-А, I-Б, I-В, "магистральная дорога", "магистральная улица общегородского значения", и (или) дорожных сооружений на них'
      },
      {
        'key': 22,
        'value': 80,
        'text': 'Дорог в границах железнодорожных переездов категорий I и (или) II'
      },
      {
        'key': 23,
        'value': 70,
        'text': 'Категорий II, "магистральная улица районного значения" и (или) дорожных сооружений на них'
      },
      {
        'key': 24,
        'value': 70,
        'text': 'Дорог в границах железнодорожных переездов категории III'
      },
      {
        'key': 25,
        'value': 60,
        'text': 'Категории III и (или) дорожных сооружений на них'
      },
      {
        'key': 26,
        'value': 60,
        'text': 'Дорог в границах железнодорожных переездов, кроме переездов, отнесенных к категориям I – III'
      }
    ],
    '3' : [
      {
        'key': 31,
        'value': 100,
        'text': 'Наличие за прошедшие 2 года приговора суда о привлечении к уголовной ответственности лица (должностного лица (сотрудника) ЮЛ, ИП или его сотрудника) за совершение деяния, предусмотренногоч.2 и ч.3 ст. 293 УК РФ'
      },
      {
        'key': 32,
        'value': 100,
        'text': 'Наличие за прошедшие 2 года административного наказания субъекту надзора и (или) его должностному лицу за совершение административного правонарушения, предусмотренного ч.2 ст.12.34 Кодекса РФ об административных правонарушениях'
      },
      {
        'key': 33,
        'value': 90,
        'text': 'Наличие за прошедшие 2 года 2 и более постановлений о назначении административного наказания субъекту надзора и (или) его должностному лицу за совершение административного правонарушения, предусмотренного ч. 28 ст. 19.5 Кодекса РФ об административных правонарушениях'
      },
      {
        'key': 34,
        'value': 90,
        'text': 'Наличие за прошедшие 2 года 35 и более решений (постановлений) о назначении административного наказания субъекту надзора и (или) его должностному лицу за совершение административных правонарушений, предусмотренных ст. 12.33, ч.1 ст. 12.34, ч. 27 ст. 19.5 Кодекса РФ об административных правонарушениях'
      },
      {
        'key': 35,
        'value': 80,
        'text': 'Наличие за прошедшие 3 года 30 - 34 решений (постановлений) о назначении административного наказания субъекту надзора и (или) его должностному лицу за совершение административных правонарушений, предусмотренных ст. 12.33, ч. 1 ст. 12.34, ч.27 ст. 19.5 Кодекса РФ об административных правонарушениях'
      },
      {
        'key': 36,
        'value': 70,
        'text': 'Наличие за прошедшие 3 года 20 - 29 решений (постановлений) о назначении административного наказания субъекту надзора и (или) его должностному лицу за совершение административных правонарушений, предусмотренных ст. 12.33, ч. 1 ст. 12.34, ч.27 ст. 19.5 Кодекса РФ об административных правонарушениях'
      },
      {
        'key': 37,
        'value': -10,
        'text': 'Отсутствие в течение прошедших 3 лет постановлений о назначении административного наказания субъекту надзора и (или) его должностному лицу за совершение административного правонарушения, предусмотренного ст. 12.33, ч. 1 ст. 12.34, частями 27 и 28 ст. 19.5 Кодекса РФ об административных правонарушениях'
      }
    ],
    '4' : [
      {
        'key': 41,
        'value': 90,
        'text': 'Осуществление организованных перевозок группы детей автобусами или перевозок опасных грузов, являющихся грузами повышенной опасности в соответствии с положениями Европейского соглашения о международной дорожной перевозке опасных грузов от 30 сентября 1957 г. (ДОПОГ)'
      },
      {
        'key': 42,
        'value': 80,
        'text': 'Осуществление перевозок пассажиров автобусами (за исключением организованных перевозок группы детей и перевозок легковыми такси)'
      },
      {
        'key': 43,
        'value': 70,
        'text': 'Осуществление перевозок легковыми такси'
      },
      {
        'key': 44,
        'value': 60,
        'text': 'Эксплуатация транспортных средств категорий M2, M3, N2, N3'
      },
      {
        'key': 45,
        'value': 10,
        'text': 'Работы / услуги  по техническому обслуживанию и ремонту транспортных средств, а также при осуществлении деятельности по эксплуатации транспортных средств'
      }
    ],
    '5' : [
      {
        'key': 51,
        'value': 100,
        'text': 'Наличие за прошедшие 2 года приговора суда в отношении водителя эксплуатируемого транспортного средства за совершение деяния, предусмотренного ст. 264 Уголовного Кодекса РФ'
      },
      {
        'key': 52,
        'value': 100,
        'text': 'Наличие за прошедшие 2 года решения о назначении административного наказания в отношении водителя эксплуатируемого транспортного средства за совершение административного правонарушения, предусмотренного ст. 12.24 Кодекса РФ об административных правонарушениях'
      },
      {
        'key': 53,
        'value': 90,
        'text': 'Наличие за прошедшие 2 года 2 и более постановлений о назначении административного наказания субъекту надзора и (или) его должностному лицу за совершение административного правонарушения, предусмотренного ст. 12.32 и (или) ч. 28 ст. 19.5 Кодекса РФ об административных правонарушениях'
      },
      {
        'key': 54,
        'value': 80,
        'text': 'Наличие за прошедшие 3 года 30 и более постановлений о назначении административного наказания субъекту надзора и (или) его должностному лицу за совершение административных правонарушений, предусмотренных ч. 1 ст. 11.23, ч. 3 ст. 12.2, ст. 12.4, ч. 2 ст. 12.21.2, ст. 12.31, 12.31.1, 12.37, ч. 1 ст. 19.22, ч. 27 ст. 19.5 Кодекса РФ об административных правонарушениях'
      },
      {
        'key': 55,
        'value': 70,
        'text': 'Наличие за прошедшие 3 года 20 - 29 постановлений о назначении административного наказания субъекту надзора и (или) его должностному лицу за совершение административных правонарушений, предусмотренных ч. 1 ст. 11.23, ч. 3 ст. 12.2, ст. 12.4, ч. 2 ст. 12.21.2, ст. 12.31, 12.31.1, 12.37, ч. 1 ст. 19.22, ч. 27 ст. 19.5 Кодекса РФ об административных правонарушениях'
      },
      {
        'key': 56,
        'value': -10,
        'text': 'Отсутствии в течение прошедших 3 лет постановлений о назначении административного наказания субъекту надзора и (или) его должностному лицу за совершение административного правонарушения, предусмотренного ч. 1 ст. 11.23, ч. 3 ст. 12.2, ст.12.4, ч. 2 ст. 12.21.2, ст. 12.31, 12.31.1, 12.32, 12.37, ч. 1 ст. 19.22, ч.27 и 28 ст. 19.5 Кодекса РФ об административных правонарушениях'
      }
    ]  
  },
  'risks': {
    '100': 'Чрезвычайно высокий риск',
    '90': 'Высокий риск',
    '80': 'Значительный риск',
    '70': 'Средний риск',
    '60': 'Умеренный риск',
    '10': 'Низкий риск',
  }
}

const settings = window.ttConfig ? window.ttConfig : settingsDefault;

const params = {
  settings: settings,
  risks: settings.risks,
  steps: settings.steps
}
export default params;